{
    "facts": [
        { "title": "Fact 1", "body": "Final Fantasy VII was originally planned for the SNES but moved to the PlayStation due to hardware limitations." },
        { "title": "Fact 2", "body": "Cloud Strife's iconic weapon, the Buster Sword, is nearly six feet tall!" },
        { "title": "Fact 3", "body": "The game's initial budget was $45 million, making it one of the most expensive video games at the time." },
        { "title": "Fact 4", "body": "Aerith Gainsborough was originally intended to survive, but her death became one of gaming's most iconic moments." },
        { "title": "Fact 5", "body": "Final Fantasy VII's story draws inspiration from Norse mythology, particularly the Ragnarok legend." },
        { "title": "Fact 6", "body": "The game features one of the first 3D cinematic cutscenes in gaming history." },
        { "title": "Fact 7", "body": "Sephiroth's name comes from the Kabbalah, a mystical tradition of Judaism." },
        { "title": "Fact 8", "body": "Red XIII's species is nearly extinct, making him one of the last of his kind." },
        { "title": "Fact 9", "body": "The game inspired a movie sequel, 'Final Fantasy VII: Advent Children'." },
        { "title": "Fact 10", "body": "The Chocobo theme has been present in every main Final Fantasy game since the second installment." },
        { "title": "Fact 11", "body": "The original Japanese release of Final Fantasy VII had no analog stick support because the PlayStation DualShock controller wasn't released yet." },
        { "title": "Fact 12", "body": "Tifa Lockhart was almost cut from the game during development but was retained to provide a love triangle dynamic with Cloud and Aerith." },
        { "title": "Fact 13", "body": "The game's iconic villain, Sephiroth, originally had a theme song with lyrics in Japanese before 'One-Winged Angel' became his final theme with Latin lyrics." },
        { "title": "Fact 14", "body": "The famous 'Gold Saucer' amusement park in Final Fantasy VII was inspired by Disneyland." },
        { "title": "Fact 15", "body": "Vincent Valentine was originally designed as a vampire-like character, which is why his transformations and aesthetic reflect Gothic horror." },
        { "title": "Fact 16", "body": "The summon 'Knights of the Round' requires breeding a gold chocobo to access its secret cave location." },
        { "title": "Fact 17", "body": "Final Fantasy VII was one of the first games to feature environmental storytelling through pre-rendered backgrounds." },
        { "title": "Fact 18", "body": "The game was partially inspired by real-world events, including the rise of megacorporations and ecological concerns about energy consumption." },
        { "title": "Fact 19", "body": "Yuffie Kisaragi and Vincent Valentine are optional characters who can be missed entirely during a playthrough." },
        { "title": "Fact 20", "body": "The game has a hidden 'date' mechanic where Cloud can end up on a date with Tifa, Aerith, Yuffie, or even Barret, depending on the player's choices." },
        { "title": "Fact 21", "body": "The character of Cloud Strife was originally envisioned with black hair, but it was changed to blonde to stand out against the game's dark backdrops." },
        { "title": "Fact 22", "body": "Final Fantasy VII has a debug room that can be accessed with cheats, allowing players to explore unfinished areas and mechanics." },
        { "title": "Fact 23", "body": "Aerith’s house has a flower bed that, if trampled too much, triggers a humorous line from her about being careful." },
        { "title": "Fact 24", "body": "In Costa del Sol, you can buy the Shinra Manager's vacation house for 300,000 gil, but it serves no practical purpose." },
        { "title": "Fact 25", "body": "The weapon 'Masamune Blade' in Sephiroth’s flashbacks can never be equipped by the player, as it’s exclusive to him." },
        { "title": "Fact 26", "body": "The haunted hotel in the Gold Saucer is a subtle reference to *The Shining*, complete with spooky music and decor." },
        { "title": "Fact 27", "body": "The ‘Wutai side quest’ is a hidden arc that adds depth to Yuffie’s character, involving stolen materia and the Turks." },
        { "title": "Fact 28", "body": "If you name Red XIII as 'Nanaki,' his real name, it leads to funny dialogue moments when other characters act surprised." },
        { "title": "Fact 29", "body": "The Highwind airship is named after Cid Highwind, who dreams of reaching the skies and space." },
        { "title": "Fact 30", "body": "In the Sector 7 slums, there’s a poster for 'Loveless,' a play referenced multiple times in the Final Fantasy VII universe." },
        { "title": "Fact 31", "body": "In the Shinra building, there’s a bathroom on one of the floors that you can access to overhear enemy conversations." },
        { "title": "Fact 32", "body": "The Midgar Zolom, an early-game enemy, foreshadows Sephiroth’s power as it’s found impaled on a tree later in the game." },
        { "title": "Fact 33", "body": "Tifa's piano in Nibelheim can be played, and if you play a specific tune, you can unlock her Limit Break 'Final Heaven' later." },
        { "title": "Fact 34", "body": "Cloud's iconic 'omnislash' Limit Break can be obtained at the Gold Saucer’s Battle Square by earning battle points." },
        { "title": "Fact 35", "body": "If you repeatedly refuse to climb the rope in the Corel Prison area, Barret will scold you in frustration." },
        { "title": "Fact 36", "body": "The weapons Ruby and Emerald were added in the international version of the game as bonus super-bosses." },
        { "title": "Fact 37", "body": "Sephiroth’s theme 'One-Winged Angel' was the first Final Fantasy track to use live orchestral vocals." },
        { "title": "Fact 38", "body": "If you keep Aerith in your party until the Temple of the Ancients, she will occasionally mention hearing voices from the Cetra." },
        { "title": "Fact 39", "body": "The game features a hidden dialogue with a moogle in Mog's House mini-game, which teaches you about raising chocobos." },
        { "title": "Fact 40", "body": "Cid Highwind has a secret Limit Break called 'Highwind,' which is obtained from a chest in the sunken Gelnika plane." }
    ]
}
